Tekla.Structures.TeklaStructuresDatabaseTypeEnum
The object types to be used in filter expressions.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.UNKNOWN
The unknown type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.POINT
The point type, this is not a ModelObject.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.PART
The part type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.CONNECTION
The connection type, used for details and seams as well.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.COMPONENT
The component type, used for macros, plug-ins and custom parts.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.GRID
The grid type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.FITTING
The fitting type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.BOLT
The bolt type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.PART_CUT
The part cut type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.PLANE_CUT
The plane cut type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.WELDING
The welding type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.ASSEMBLY
The assembly type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.CONSTRUCTION_LINE
The construction line type, this is not a ModelObject.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.PLANE
The plane type, used for control planes and grid planes.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.DRAWING
The drawing.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.DB_CONNECTION
The connection type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.PART_ADD
The part add type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.WELD_CUT
The weld preparation.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.CONSTRUCTION_CIRCLE
The construction circle type, this is not a ModelObject.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.CONSTRUCTION_ARC
The construction arc

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.DB_COMPONENT
The component type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.REBAR
The rebar type, used for single rebars, groups, meshes and strands.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.FOREIGN_OBJECT
The foreign object.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.LOAD_LOAD
The load type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.LOAD_POINT
The load point type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.LOAD_LINE
The load line type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.LOAD_AREA
The load area type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.LOAD_UNIFORM
The load uniform type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.LOAD_GROUP
The load group type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.LOAD_TEMPERATURELOAD
The temperature load type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.SURFACE_TREATMENT
The surface treatment type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.REBAR_SPLICE
The rebar splice type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.ANALYSIS_MODEL
The analysis model.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.ANALYSIS_PART
The analysis part.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.ANALYSIS_NODE
The analysis node.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.EDGE_CHAMFER
The edge chamfer type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.TASK
The task type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.TASK_DEPENDENCY
The task dependency type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.TASK_WORKTYPE
The task worktype type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.HIERARCHIC_DEFINITION
The hierarchic definition type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.HIERARCHIC_OBJECT
The hierarchic object type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.DB_POUR_BREAK
The pour break type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.DB_POUR_OBJECT
The pour object type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.REBARSET_ADDITION
The rebar set addition type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.REBARSET_MODIFIER
The rebar set modifier type.

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.SURFACE_OBJECT
The surface object type

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.BENT_PLATE
The bent plate type

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.HELIX
The helix type

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.DB_POUR_UNIT
The pour unit type

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.CONSTRUCTION_POLYCURVE
The construction polycurve

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.STOREY
Building Hierarchy Storey

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.BUILDING_SITE
Building Hierarchy Building

Tekla.Structures.TeklaStructuresDatabaseTypeEnum.BUILDING
Building Hierarchy Site